IDEA Open Model
ConnectionCheckRes Properties
Compatible with IDEA StatiCa 20.1
The ConnectionCheckRes type exposes the following members.
Properties
Name | Description
ConnectionID
 Guid of connection
CheckResAnchor
 List of check results for anchors
CheckResBolt
 List of check results for bolts
CheckResConcreteBlock
 List of check results for concrete blocks
CheckResPlate
 List of check results for plates
CheckResSummary
 List of CheckResSummary
CheckResWeld
 List of check results for welds
Messages
 Gets or sets the list of errors, that apears during validation and/or calculation.
Name
 Name of connection
Top
See Also
Reference
ConnectionCheckRes Class
IdeaRS.OpenModel.Connection Namespace